
<details><summary>Show Plan</summary>

``` terraform
terraform
module.sdk_analysis.module.ecs_task.null_resource.docker_build: Refreshing state... [id=8509530227199128232]
module.sdk_analysis.module.lambda.null_resource.docker_build: Refreshing state... [id=2280426106182959632]
module.downloads[0].aws_iam_role.downloads_role: Refreshing state... [id=s3_downloads_role]
module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk-analysis-logs: Refreshing state... [id=prod-sdk-analysis]
module.sdk_analysis.aws_s3_bucket.upload_bucket: Refreshing state... [id=prod-sdk-upload]
module.sdk_analysis.module.ecs_task.aws_default_vpc.default_vpc: Refreshing state... [id=vpc-95c232e8]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_c: Refreshing state... [id=subnet-1b3c4b56]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_a: Refreshing state... [id=subnet-026fcb64]
module.sdk_analysis.module.ecs_task.aws_default_subnet.default_subnet_b: Refreshing state... [id=subnet-e0fc5ec1]
module.downloads[0].aws_s3_bucket.log_bucket: Refreshing state... [id=curibio-prod-server-access-logs]
module.sdk_analysis.module.ecs_task.aws_ecs_cluster.aws-ecs-cluster: Refreshing state... [id=arn:aws:ecs:us-east-1:245339368379:cluster/prod-sdk_analysis-cluster]
module.downloads[0].aws_route53_zone.main: Refreshing state... [id=Z00493513SFYX7KIRT3B6]
module.sdk_analysis.aws_s3_bucket.analyzed_bucket: Refreshing state... [id=prod-sdk-analyzed]
module.jupyter_notebook[0].aws_s3_bucket.jupyter: Refreshing state... [id=jupyter-sdk.curibio.com]
module.sdk_analysis.aws_sqs_queue.sdk_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-queue-deadletter]
module.downloads[0].aws_acm_certificate.cert: Refreshing state... [id=arn:aws:acm:us-east-1:245339368379:certificate/6354ca50-99dc-4b91-a815-c1f3ca723df9]
module.sdk_analysis.module.ecs_task.aws_ecr_repository.ecr: Refreshing state... [id=prod-sdk_analysis]
module.sdk_analysis.module.lambda.aws_ecr_repository.ecr: Refreshing state... [id=prod-sdk_upload]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecsTaskExecutionRole: Refreshing state... [id=prod-sdk_analysis-execution-task-role]
module.sdk_analysis.module.ecs_task.null_resource.docker_tag: Refreshing state... [id=2987157791685770596]
module.sdk_analysis.module.ecs_task.null_resource.docker_push: Refreshing state... [id=412358223870055198]
module.downloads[0].aws_route53_record.sqsp_www: Refreshing state... [id=Z00493513SFYX7KIRT3B6_www_CNAME]
module.downloads[0].aws_route53_record.cname_ssl_verification["*.curibio.com"]: Refreshing state... [id=Z00493513SFYX7KIRT3B6__cf8a73a02ed777d265f1e560422d8381.curibio.com._CNAME]
module.downloads[0].aws_route53_record.sqsp_verify: Refreshing state... [id=Z00493513SFYX7KIRT3B6_a6a6hxwse7f7keb3h845_CNAME]
module.downloads[0].aws_route53_record.google_site_verification: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_TXT]
module.downloads[0].aws_route53_record.mx_record: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_MX]
module.downloads[0].aws_route53_record.a_record: Refreshing state... [id=Z00493513SFYX7KIRT3B6_curibio.com_A]
module.downloads[0].aws_route53_record.github_verification: Refreshing state... [id=Z00493513SFYX7KIRT3B6__github-challenge-curibio.www.curibio.com_TXT]
module.jupyter_notebook[0].aws_cloudfront_distribution.jupyter_sdk_distribution: Refreshing state... [id=EQU24OD7P9BYZ]
module.sdk_analysis.module.lambda.null_resource.docker_tag: Refreshing state... [id=214502239573706553]
module.sdk_analysis.module.ecs_task.aws_iam_role_policy_attachment.ecsTaskExecutionRole_policy: Refreshing state... [id=prod-sdk_analysis-execution-task-role-20210908162419459500000001]
module.downloads[0].aws_acm_certificate_validation.cert: Refreshing state... [id=2021-03-17 15:56:52 +0000 UTC]
module.sdk_analysis.module.lambda.null_resource.docker_push: Refreshing state... [id=8018605442060636623]
module.downloads[0].aws_s3_bucket.downloads: Refreshing state... [id=downloads.curibio.com]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0]: Refreshing state... [id=prod-sdk-upload-lambda-logs]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.additional_inline[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/prod-sdk-upload-lambda]
module.sdk_analysis.aws_sqs_queue.sdk_upload_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-upload-queue]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.jupyter_notebook[0].aws_route53_record.jupyter_cname: Refreshing state... [id=Z00493513SFYX7KIRT3B6_jupyter-sdk.curibio.com_CNAME]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-inline]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-logs]
module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role: Refreshing state... [id=prod-sdk_analysis-ecs_task_role]
module.sdk_analysis.aws_s3_bucket_notification.bucket_notification: Refreshing state... [id=prod-sdk-upload]
module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0]: Refreshing state... [id=prod-sdk-upload-lambda]
module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task: Refreshing state... [id=prod-sdk_analysis-ecs-task-definition]
module.downloads[0].aws_s3_bucket_policy.downloads_policy: Refreshing state... [id=downloads.curibio.com]
module.downloads[0].aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1OSG2PRSZKP4F]
module.downloads[0].aws_iam_role_policy.s3_downloads: Refreshing state... [id=s3_downloads_role:s3_downloads_policy]
module.downloads[0].aws_route53_record.cname: Refreshing state... [id=Z00493513SFYX7KIRT3B6_downloads.curibio.com_CNAME]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.api.aws_apigatewayv2_api.lambda_gw will be created
  + resource "aws_apigatewayv2_api" "lambda_gw" {
      + api_endpoint                 = (known after apply)
      + api_key_selection_expression = "$request.header.x-api-key"
      + arn                          = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + name                         = "prod-lambda-gw"
      + protocol_type                = "HTTP"
      + route_selection_expression   = "$request.method $request.path"
      + tags_all                     = (known after apply)
    }

  # module.api.aws_apigatewayv2_authorizer.lambda_gw_auth will be created
  + resource "aws_apigatewayv2_authorizer" "lambda_gw_auth" {
      + api_id                           = (known after apply)
      + authorizer_result_ttl_in_seconds = (known after apply)
      + authorizer_type                  = "JWT"
      + id                               = (known after apply)
      + identity_sources                 = [
          + "$request.header.Authorization",
        ]
      + name                             = "prod-lambda-gw-authorizer"

      + jwt_configuration {
          + audience = (known after apply)
          + issuer   = (known after apply)
        }
    }

  # module.api.aws_apigatewayv2_integration.get_auth_integration will be created
  + resource "aws_apigatewayv2_integration" "get_auth_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Get auth integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_integration.get_sdk_status_integration will be created
  + resource "aws_apigatewayv2_integration" "get_sdk_status_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "Get SDK Status Integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = (known after apply)
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_integration.sdk_upload_integration will be created
  + resource "aws_apigatewayv2_integration" "sdk_upload_integration" {
      + api_id                                    = (known after apply)
      + connection_type                           = "INTERNET"
      + description                               = "SDK Upload Integration"
      + id                                        = (known after apply)
      + integration_method                        = "POST"
      + integration_response_selection_expression = (known after apply)
      + integration_type                          = "AWS_PROXY"
      + integration_uri                           = "arn:aws:apigateway:us-east-1:lambda:path/2015-03-31/functions/arn:aws:lambda:us-east-1:245339368379:function:prod-sdk-upload-lambda/invocations"
      + payload_format_version                    = "1.0"
      + timeout_milliseconds                      = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.get_auth will be created
  + resource "aws_apigatewayv2_route" "get_auth" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "NONE"
      + id                 = (known after apply)
      + route_key          = "POST /get_auth"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.get_sdk_status will be created
  + resource "aws_apigatewayv2_route" "get_sdk_status" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "GET /get_sdk_status"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_route.sdk_upload will be created
  + resource "aws_apigatewayv2_route" "sdk_upload" {
      + api_id             = (known after apply)
      + api_key_required   = false
      + authorization_type = "JWT"
      + authorizer_id      = (known after apply)
      + id                 = (known after apply)
      + route_key          = "POST /sdk_upload"
      + target             = (known after apply)
    }

  # module.api.aws_apigatewayv2_stage.lambda_gw_stage will be created
  + resource "aws_apigatewayv2_stage" "lambda_gw_stage" {
      + api_id        = (known after apply)
      + arn           = (known after apply)
      + auto_deploy   = true
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + name          = "prod-lambda-gw-stage"
      + tags_all      = (known after apply)

      + access_log_settings {
          + destination_arn = (known after apply)
          + format          = jsonencode(
                {
                  + httpMethod              = "$context.httpMethod"
                  + integrationErrorMessage = "$context.integrationErrorMessage"
                  + protocol                = "$context.protocol"
                  + requestId               = "$context.requestId"
                  + requestTime             = "$context.requestTime"
                  + resourcePath            = "$context.resourcePath"
                  + responseLength          = "$context.responseLength"
                  + routeKey                = "$context.routeKey"
                  + sourceIp                = "$context.identity.sourceIp"
                  + status                  = "$context.status"
                }
            )
        }
    }

  # module.api.aws_cloudwatch_log_group.api_gw will be created
  + resource "aws_cloudwatch_log_group" "api_gw" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/api_gw/prod-lambda-gw"
      + retention_in_days = 0
      + tags              = {
          + "Application" = "api-gw"
          + "Environment" = "prod"
        }
      + tags_all          = {
          + "Application" = "api-gw"
          + "Environment" = "prod"
        }
    }

  # module.api.aws_cognito_user_pool.lambda_gw_pool will be created
  + resource "aws_cognito_user_pool" "lambda_gw_pool" {
      + arn                        = (known after apply)
      + creation_date              = (known after apply)
      + custom_domain              = (known after apply)
      + domain                     = (known after apply)
      + email_verification_message = (known after apply)
      + email_verification_subject = (known after apply)
      + endpoint                   = (known after apply)
      + estimated_number_of_users  = (known after apply)
      + id                         = (known after apply)
      + last_modified_date         = (known after apply)
      + mfa_configuration          = "OFF"
      + name                       = "prod-lambda-gw-pool"
      + sms_verification_message   = (known after apply)
      + tags_all                   = (known after apply)

      + admin_create_user_config {
          + allow_admin_create_user_only = (known after apply)

          + invite_message_template {
              + email_message = (known after apply)
              + email_subject = (known after apply)
              + sms_message   = (known after apply)
            }
        }

      + password_policy {
          + minimum_length                   = (known after apply)
          + require_lowercase                = (known after apply)
          + require_numbers                  = (known after apply)
          + require_symbols                  = (known after apply)
          + require_uppercase                = (known after apply)
          + temporary_password_validity_days = (known after apply)
        }

      + sms_configuration {
          + external_id    = (known after apply)
          + sns_caller_arn = (known after apply)
        }

      + verification_message_template {
          + default_email_option  = (known after apply)
          + email_message         = (known after apply)
          + email_message_by_link = (known after apply)
          + email_subject         = (known after apply)
          + email_subject_by_link = (known after apply)
          + sms_message           = (known after apply)
        }
    }

  # module.api.aws_cognito_user_pool_client.lambda_gw_pool_client will be created
  + resource "aws_cognito_user_pool_client" "lambda_gw_pool_client" {
      + callback_urls                 = (known after apply)
      + client_secret                 = (sensitive value)
      + enable_token_revocation       = (known after apply)
      + explicit_auth_flows           = [
          + "USER_PASSWORD_AUTH",
        ]
      + id                            = (known after apply)
      + logout_urls                   = (known after apply)
      + name                          = "prod-lambda-gw-pool-client"
      + prevent_user_existence_errors = (known after apply)
      + refresh_token_validity        = 30
      + user_pool_id                  = (known after apply)
    }

  # module.api.aws_iam_role.iam_for_lambda will be created
  + resource "aws_iam_role" "iam_for_lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-iam-for-lambda"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.api.aws_iam_role_policy_attachment.lambda_policy will be created
  + resource "aws_iam_role_policy_attachment" "lambda_policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "prod-iam-for-lambda"
    }

  # module.api.aws_lambda_permission.get_auth_lambda_permission will be created
  + resource "aws_lambda_permission" "get_auth_lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "prod-get-auth"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowGetAuthAPIInvoke"
    }

  # module.api.aws_lambda_permission.get_sdk_status_lambda_permission will be created
  + resource "aws_lambda_permission" "get_sdk_status_lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "prod-get-sdk-status"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowSDKStatusAPIInvoke"
    }

  # module.api.aws_lambda_permission.sdk_upload_lambda_permission will be created
  + resource "aws_lambda_permission" "sdk_upload_lambda_permission" {
      + action        = "lambda:InvokeFunction"
      + function_name = "prod-sdk-upload-lambda"
      + id            = (known after apply)
      + principal     = "apigateway.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = "AllowSDKUploadAPIInvoke"
    }

  # module.sdk_status_db.aws_dynamodb_table.sdk_analysis_statuses will be created
  + resource "aws_dynamodb_table" "sdk_analysis_statuses" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "upload_id"
      + id               = (known after apply)
      + name             = "prod-sdk-analysis-statuses"
      + read_capacity    = 1
      + stream_arn       = (known after apply)
      + stream_label     = (known after apply)
      + stream_view_type = (known after apply)
      + tags_all         = (known after apply)
      + write_capacity   = 1

      + attribute {
          + name = "upload_id"
          + type = "S"
        }

      + point_in_time_recovery {
          + enabled = (known after apply)
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # module.get_auth.module.lambda.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "prod-get_auth"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.get_auth.module.lambda.null_resource.docker_build will be created
  + resource "null_resource" "docker_build" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "266b7882de01a57f700792aa66e11612"
        }
    }

  # module.get_auth.module.lambda.null_resource.docker_push will be created
  + resource "null_resource" "docker_push" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "266b7882de01a57f700792aa66e11612"
        }
    }

  # module.get_auth.module.lambda.null_resource.docker_tag will be created
  + resource "null_resource" "docker_tag" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "266b7882de01a57f700792aa66e11612"
        }
    }

  # module.get_sdk_status.module.lambda.aws_ecr_repository.ecr will be created
  + resource "aws_ecr_repository" "ecr" {
      + arn                  = (known after apply)
      + id                   = (known after apply)
      + image_tag_mutability = "MUTABLE"
      + name                 = "prod-get_sdk_status"
      + registry_id          = (known after apply)
      + repository_url       = (known after apply)
      + tags_all             = (known after apply)

      + image_scanning_configuration {
          + scan_on_push = true
        }
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_build will be created
  + resource "null_resource" "docker_build" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "2f7560a05813eb24a88b15286693946e"
        }
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_push will be created
  + resource "null_resource" "docker_push" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "2f7560a05813eb24a88b15286693946e"
        }
    }

  # module.get_sdk_status.module.lambda.null_resource.docker_tag will be created
  + resource "null_resource" "docker_tag" {
      + id       = (known after apply)
      + triggers = {
          + "hash" = "2f7560a05813eb24a88b15286693946e"
        }
    }

  # module.sdk_analysis.module.ecs_task.data.aws_ecs_task_definition.main will be read during apply
  # (config refers to values not yet known)
 <= data "aws_ecs_task_definition" "main"  {
      ~ family          = "prod-sdk_analysis-ecs-task-definition" -> (known after apply)
      ~ id              = "arn:aws:ecs:us-east-1:245339368379:task-definition/prod-sdk_analysis-ecs-task-definition:1" -> (known after apply)
      ~ network_mode    = "awsvpc" -> (known after apply)
      ~ revision        = 1 -> (known after apply)
      ~ status          = "ACTIVE" -> (known after apply)
      ~ task_role_arn   = "arn:aws:iam::245339368379:role/prod-sdk_analysis-ecs_task_role" -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk-analysis-logs will be destroyed
  - resource "aws_cloudwatch_log_group" "sdk-analysis-logs" {
      - arn               = "arn:aws:logs:us-east-1:245339368379:log-group:prod-sdk-analysis" -> null
      - id                = "prod-sdk-analysis" -> null
      - name              = "prod-sdk-analysis" -> null
      - retention_in_days = 0 -> null
      - tags              = {
          - "Application" = "sdk-analysis"
          - "Environment" = "prod"
        } -> null
      - tags_all          = {
          - "Application" = "sdk-analysis"
          - "Environment" = "prod"
        } -> null
    }

  # module.sdk_analysis.module.ecs_task.aws_cloudwatch_log_group.sdk_analysis_logs will be created
  + resource "aws_cloudwatch_log_group" "sdk_analysis_logs" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "prod-sdk-analysis"
      + retention_in_days = 0
      + tags              = {
          + "Application" = "sdk-analysis"
          + "Environment" = "prod"
        }
      + tags_all          = {
          + "Application" = "sdk-analysis"
          + "Environment" = "prod"
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_service.aws-ecs-service will be created
  + resource "aws_ecs_service" "aws-ecs-service" {
      + cluster                            = "arn:aws:ecs:us-east-1:245339368379:cluster/prod-sdk_analysis-cluster"
      + deployment_maximum_percent         = 200
      + deployment_minimum_healthy_percent = 0
      + desired_count                      = 0
      + enable_ecs_managed_tags            = false
      + enable_execute_command             = false
      + force_new_deployment               = true
      + iam_role                           = (known after apply)
      + id                                 = (known after apply)
      + launch_type                        = "FARGATE"
      + name                               = "prod-sdk_analysis-ecs-service"
      + platform_version                   = (known after apply)
      + scheduling_strategy                = "REPLICA"
      + tags_all                           = (known after apply)
      + task_definition                    = (known after apply)
      + wait_for_steady_state              = false

      + network_configuration {
          + assign_public_ip = true
          + subnets          = [
              + "subnet-026fcb64",
              + "subnet-1b3c4b56",
              + "subnet-e0fc5ec1",
            ]
        }
    }

  # module.sdk_analysis.module.ecs_task.aws_ecs_task_definition.aws-ecs-task must be replaced
-/+ resource "aws_ecs_task_definition" "aws-ecs-task" {
      ~ arn                      = "arn:aws:ecs:us-east-1:245339368379:task-definition/prod-sdk_analysis-ecs-task-definition:1" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - cpu              = 256
                  - environment      = [
                      - {
                          - name  = "S3_UPLOAD_BUCKET"
                          - value = "prod-sdk-analyzed"
                        },
                      - {
                          - name  = "SQS_URL"
                          - value = "https://sqs.us-east-1.amazonaws.com/245339368379/prod-sdk-upload-queue"
                        },
                    ]
                  - essential        = true
                  - image            = "245339368379.dkr.ecr.us-east-1.amazonaws.com/prod-sdk_analysis:latest"
                  - logConfiguration = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "sdk-analysis-test"
                          - awslogs-region        = "us-east-1"
                          - awslogs-stream-prefix = "sdk-analysis-service"
                        }
                    }
                  - memory           = 512
                  - mountPoints      = []
                  - name             = "prod-sdk_analysis"
                  - portMappings     = []
                  - volumesFrom      = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ id                       = "prod-sdk_analysis-ecs-task-definition" -> (known after apply)
      ~ revision                 = 1 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (7 unchanged attributes hidden)
    }

  # module.sdk_analysis.module.ecs_task.aws_iam_role.ecs_task_role will be updated in-place
  ~ resource "aws_iam_role" "ecs_task_role" {
        id                    = "prod-sdk_analysis-ecs_task_role"
        name                  = "prod-sdk_analysis-ecs_task_role"
        tags                  = {}
        # (9 unchanged attributes hidden)

      - inline_policy {
          - name   = "prod-sdk_analysis-ecs_inline_policy" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "sqs:ReceiveMessage",
                              - "sqs:DeleteMessage",
                            ]
                          - Effect   = "Allow"
                          - Resource = "arn:aws:sqs:us-east-1:245339368379:prod-sdk-upload-queue"
                        },
                      - {
                          - Action   = [
                              - "s3:GetObject",
                              - "s3:PutObject",
                              - "s3:ListBucket",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:s3:::prod-sdk-upload",
                              - "arn:aws:s3:::prod-sdk-upload/*",
                              - "arn:aws:s3:::prod-sdk-analyzed",
                              - "arn:aws:s3:::prod-sdk-analyzed/*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      + inline_policy {
          + name   = "prod-sdk_analysis-ecs_inline_policy"
          + policy = (known after apply)
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_build must be replaced
-/+ resource "null_resource" "docker_build" {
      ~ id       = "8509530227199128232" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "bbe51e3efa7173feef9014c8f9e38bed" -> "6fb44a44bc4b79cab9915ec613c87a5c"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_push must be replaced
-/+ resource "null_resource" "docker_push" {
      ~ id       = "412358223870055198" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "bbe51e3efa7173feef9014c8f9e38bed" -> "6fb44a44bc4b79cab9915ec613c87a5c"
        }
    }

  # module.sdk_analysis.module.ecs_task.null_resource.docker_tag must be replaced
-/+ resource "null_resource" "docker_tag" {
      ~ id       = "2987157791685770596" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "bbe51e3efa7173feef9014c8f9e38bed" -> "6fb44a44bc4b79cab9915ec613c87a5c"
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_build must be replaced
-/+ resource "null_resource" "docker_build" {
      ~ id       = "2280426106182959632" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "" -> "46288da4ba422293effad8813c805660"
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_push must be replaced
-/+ resource "null_resource" "docker_push" {
      ~ id       = "8018605442060636623" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "" -> "46288da4ba422293effad8813c805660"
        }
    }

  # module.sdk_analysis.module.lambda.null_resource.docker_tag must be replaced
-/+ resource "null_resource" "docker_tag" {
      ~ id       = "214502239573706553" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "hash" = "" -> "46288da4ba422293effad8813c805660"
        }
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/prod-get-auth"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "prod-get-auth-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-get-auth"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-get-auth"
    }

  # module.get_auth.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Get auth tokens"
      + function_name                  = "prod-get-auth"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:GetItem",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "dynamodbget"
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions = [
              + "sts:AssumeRole",
            ]
          + effect  = "Allow"

          + principals {
              + identifiers = [
                  + "lambda.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
            ]
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/prod-get-sdk-status"
      + retention_in_days = 0
      + tags_all          = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be created
  + resource "aws_iam_policy" "additional_inline" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "prod-get-sdk-status-inline"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be created
  + resource "aws_iam_policy" "logs" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "prod-get-sdk-status-logs"
      + path      = "/"
      + policy    = (known after apply)
      + policy_id = (known after apply)
      + tags_all  = (known after apply)
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = (known after apply)
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "prod-get-sdk-status"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-get-sdk-status"
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "prod-get-sdk-status"
    }

  # module.get_sdk_status.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + arn                            = (known after apply)
      + description                    = "Get upload/analysis status of files"
      + function_name                  = "prod-get-sdk-status"
      + id                             = (known after apply)
      + image_uri                      = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = (known after apply)
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline"  {
      ~ id      = "1599142051" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prod-sdk-upload/*"
                      - Sid      = "s3put"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          ~ actions       = [
              + "dynamodb:PutItem",
              - "s3:PutObject",
            ]
          - not_actions   = [] -> null
          - not_resources = [] -> null
          ~ resources     = [
              - "arn:aws:s3:::prod-sdk-upload/*",
              ~ (known after apply),
            ]
          ~ sid           = "s3put" -> "dynamodbput"
            # (1 unchanged attribute hidden)
        }
      + statement {
          + actions   = [
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:s3:::prod-sdk-upload/*",
            ]
          + sid       = "s3put"
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.assume_role[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "assume_role"  {
      ~ id      = "3693445097" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
          - resources     = [] -> null
            # (2 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs"  {
      ~ id      = "486093473" -> (known after apply)
      ~ json    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:245339368379:log-group:/aws/lambda/prod-sdk-upload-lambda:*:*",
                          - "arn:aws:logs:us-east-1:245339368379:log-group:/aws/lambda/prod-sdk-upload-lambda:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
      - version = "2012-10-17" -> null

      ~ statement {
          - not_actions   = [] -> null
          - not_resources = [] -> null
            # (3 unchanged attributes hidden)
        }
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id        = "arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-inline"
        name      = "prod-sdk-upload-lambda-inline"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::prod-sdk-upload/*"
                      - Sid      = "s3put"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy.logs[0] will be updated in-place
  ~ resource "aws_iam_policy" "logs" {
        id        = "arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-logs"
        name      = "prod-sdk-upload-lambda-logs"
      ~ policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:us-east-1:245339368379:log-group:/aws/lambda/prod-sdk-upload-lambda:*:*",
                          - "arn:aws:logs:us-east-1:245339368379:log-group:/aws/lambda/prod-sdk-upload-lambda:*",
                        ]
                      - Sid      = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.additional_inline[0] will be destroyed
  - resource "aws_iam_policy_attachment" "additional_inline" {
      - groups     = [] -> null
      - id         = "prod-sdk-upload-lambda" -> null
      - name       = "prod-sdk-upload-lambda" -> null
      - policy_arn = "arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-inline" -> null
      - roles      = [
          - "prod-sdk-upload-lambda",
        ] -> null
      - users      = [] -> null
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_policy_attachment.logs[0] will be destroyed
  - resource "aws_iam_policy_attachment" "logs" {
      - groups     = [] -> null
      - id         = "prod-sdk-upload-lambda-logs" -> null
      - name       = "prod-sdk-upload-lambda-logs" -> null
      - policy_arn = "arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-logs" -> null
      - roles      = [
          - "prod-sdk-upload-lambda",
        ] -> null
      - users      = [] -> null
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role.lambda[0] will be updated in-place
  ~ resource "aws_iam_role" "lambda" {
      ~ assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                      - Sid       = ""
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        id                    = "prod-sdk-upload-lambda"
        name                  = "prod-sdk-upload-lambda"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.additional_inline[0] will be created
  + resource "aws_iam_role_policy_attachment" "additional_inline" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-inline"
      + role       = "prod-sdk-upload-lambda"
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_iam_role_policy_attachment.logs[0] will be created
  + resource "aws_iam_role_policy_attachment" "logs" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::245339368379:policy/prod-sdk-upload-lambda-logs"
      + role       = "prod-sdk-upload-lambda"
    }

  # module.sdk_analysis.module.lambda.module.lambda_function_container_image.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "prod-sdk-upload-lambda"
        tags                           = {}
        # (18 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              - "S3_BUCKET" = "prod-sdk-upload"
              - "SQS_NAME"  = "prod-sdk-upload-queue"
            } -> (known after apply)
        }

        # (1 unchanged block hidden)
    }

Plan: 49 to add, 5 to change, 10 to destroy.

------------------------------------------------------------------------

Note: You didn't specify an "-out" parameter to save this plan, so Terraform
can't guarantee that exactly these actions will be performed if
"terraform apply" is subsequently run.

Releasing state lock. This may take a few moments...

```

</details>

Pusher: @tannermpeterson